{
    "headerTitle": "Portfolio of [Your Name]",
    "navInfo": "About",
    "navExperience": "Experience",
    "navProjects": "Projects",
    "navCv": "CV",
    "infoTitle": "About",
    "infoText": "Hi! My name is Daniele Adelfio, and I am a back-end developer with experience in **developing and maintaining financial platforms**, with a particular focus on managing invoices, payments, collections, user onboarding, customer records, and factoring services such as Confirming, Reverse Factoring, Active Financing, and ESG. I have developed expertise in **integrating with ERP systems** like SAP, PITECO, DOCFINANCE, and CASSETTO FISCALE, as well as in custom development and file management via SFTP. In my role, I manage **8 repositories with 8 different db_schemas**, optimizing SQL queries, performing migrations, and using advanced tools such as Views, CTEs, and Json Aggregate. I have also implemented clients to communicate with **digital signature providers** (Infocert, Logalty) and **ESG score providers** (Cerved, Open-Es). I work in a **microservices environment with a hexagonal architecture (Hexagonal Architecture)**, primarily using **Scala 2.13 and Java 8**. I write **Unit Tests and Integration Tests**, implementing "generators" to speed up testing and populate the database with sample data. I use tools like **Jira** for task management and **Bitbucket** for Pull Requests, with CI/CD pipelines that include compilation, Unit Tests, and Integration Tests. I develop **REST APIs** documented with **Swagger**, collaborating closely with Front-End, UX, and UI teams. I also have experience in **training and mentoring Junior Developers**, guiding them in learning best practices and the technologies we use. In the cloud context, I use **AWS** (S3, CloudWatch, ECS) and **Docker Compose** for service deployment and monitoring. For debugging and performance optimization, I rely on **Honeycomb** for API call tracing. I manage automated processes with **Quartz Job Scheduler** and **CRON**, and use **Apache Kafka** for cross-service message production and consumption. Previously, as a **Junior Software Developer**, I developed mobile applications in the logistics sector using **Java and Android Studio**, created software for data collection and transmission (via USB, SOAP Web Service, or FTP), and managed SQL databases for inventory activities. I also developed a file transfer program in **C#** and provided technical support for the installation and configuration of mobile and Windows applications. My technical skills range from programming languages such as **Java, Scala, SQL, C#, HTML5, and CSS**, to development tools like **IntelliJ Ultimate, Visual Studio Code, and Android Studio**. I have solid experience with **PostgreSQL** databases and code management tools like **Git and Bitbucket**. I am a detail-oriented professional with strong problem-solving skills and experience working in multidisciplinary teams. My language skills, which include Italian as a native language, English and French at a C2 level, and Spanish at a B2 level, allow me to communicate effectively in international contexts. If you're looking for a professional with a combination of advanced technical skills, hands-on experience, and soft skills, I am confident I can contribute to the success of your team or project! 😊",
    "experienceTitle": "Experience",
    "experienceList": "<li><strong>[Company Name]</strong> - [Role] (from [Start Date] to [End Date])</li>",
    "projectsTitle": "Projects",
    "project1Title": "[Project Name 1]",
    "project1Tech": "Technologies used:",
    "project1Desc": "Description:",
    "project1Link": "View project",
    "cvTitle": "CV",
    "cvText": "Download my CV in PDF format:",
    "cvItalian": "Download CV in Italian",
    "cvEnglish": "Download CV in English",
    "footerText": "© [Year] [Your Name]. All rights reserved."
}
