{
    "headerTitle": "Portfolio di Daniele Adelfio",
    "navInfo": "Informazioni",
    "navExperience": "Esperienze",
    "navProjects": "Progetti",
    "navCv": "CV",
    "infoTitle": "Informazioni",
    "infoText": "Ciao! Mi chiamo Daniele Adelfio e sono un back-end developer con esperienza in sviluppo e manutenzione di piattaforme finanziarie**, con particolare focus sulla gestione di fatture, pagamenti, incassi, onboarding utenti, anagrafiche e servizi di factoring come Confirming, Reverse Factoring, Active Financing e ESG. Ho maturato competenze nell'**integrazione con sistemi ERP** quali SAP, PITECO, DOCFINANCE e CASSETTO FISCALE, oltre a sviluppi custom e gestione di file tramite SFTP. Nel mio ruolo, mi occupo della **gestione di 8 repository con 8 diversi db_schema**, ottimizzando query SQL, eseguendo migrazioni e utilizzando strumenti avanzati come Views, CTE e Json Aggregate. Ho inoltre implementato client per comunicare con provider di **firma digitale** (Infocert, Logalty) e provider di **score ESG** (Cerved, Open-Es). Lavoro in un ambiente basato su **microservizi con architettura esagonale (Hexagonal Architecture)**, utilizzando principalmente **Scala 2.13 e Java 8**. Scrivo **Unit Test e Integration Test**, implementando "generators" per velocizzare i test e popolare il database con dati di esempio. Utilizzo strumenti come **Jira** per la gestione dei task e **Bitbucket** per le Pull Request, con pipeline di CI/CD che includono compilazione, Unit Test e Integration Test. Sviluppo **API REST** documentate con **Swagger**, collaborando strettamente con team Front-End, UX e UI. Ho anche esperienza nella **formazione e mentoring di Junior Developers**, guidandoli nell'apprendimento delle best practice e delle tecnologie utilizzate. Nel contesto cloud, utilizzo **AWS** (S3, CloudWatch, ECS) e **Docker Compose** per il deployment e il monitoraggio dei servizi. Per il debugging e l'ottimizzazione delle prestazioni, mi avvalgo di **Honeycomb** per il tracing delle chiamate API. Gestisco processi automatizzati con **Quartz Job Scheduler** e **CRON**, e utilizzo **Apache Kafka** per la produzione e il consumo di messaggi cross-servizi. In precedenza, come **Junior Software Developer**, ho sviluppato applicazioni mobile in ambito logistico utilizzando **Java e Android Studio**, creato software per la raccolta e trasmissione di dati (via USB, Web Service SOAP o FTP) e gestito database SQL per attività di inventario. Ho anche sviluppato un programma di trasmissione file in **C#** e fornito supporto tecnico per l'installazione e configurazione di applicativi mobile e Windows. Le mie competenze tecniche spaziano dai linguaggi di programmazione come **Java, Scala, SQL, C#, HTML5 e CSS**, a strumenti di sviluppo come **IntelliJ Ultimate, Visual Studio Code e Android Studio**. Ho una solida esperienza con database **PostgreSQL** e strumenti di gestione del codice come **Git e Bitbucket**. Sono una persona con una forte attenzione ai dettagli, dotata di ottime capacità di problem-solving e abituata a lavorare in team multidisciplinari. Le mie competenze linguistiche, che includono l'italiano come madrelingua, l'inglese e il francese a livello C2, e lo spagnolo a livello B2, mi permettono di comunicare efficacemente in contesti internazionali. Se cerchi un professionista con una combinazione di competenze tecniche avanzate, esperienza pratica e capacità trasversali, sono sicuro di poter contribuire al successo del tuo team o progetto!",
    "experienceTitle": "Esperienze",
    "experienceList": "<li><strong>[Nome Azienda]</strong> - [Ruolo] (da [Data Inizio] a [Data Fine])</li>",
    "projectsTitle": "Progetti",
    "project1Title": "[Nome Progetto 1]",
    "project1Tech": "Tecnologie utilizzate:",
    "project1Desc": "Descrizione:",
    "project1Link": "Vedi progetto",
    "cvTitle": "CV",
    "cvText": "Scarica il mio CV in formato PDF:",
    "cvItalian": "Scarica CV in Italiano",
    "cvEnglish": "Scarica CV in Inglese",
    "footerText": "© [Anno] [Il Tuo Nome]. Tutti i diritti riservati."
}
